In [1]:
import numpy as np
import pandas as pd

df = pd.read_csv("./weight-height.csv",)
df.dtypes

Gender     object
Height    float64
Weight    float64
dtype: object

In [3]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [2]:
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [5]:
abc = {"Male":1, "Female":2}

df['G']=df.Gender.map(abc)
df.head()

  Gender     Height      Weight  G
0   Male  73.847017  241.893563  1
1   Male  68.781904  162.310473  1
2   Male  74.110105  212.740856  1
3   Male  71.730978  220.042470  1
4   Male  69.881796  206.349801  1

In [7]:
df.loc[0:4, "Gender":"Weight"]

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [10]:
df.iloc[[0,2,0,4,3],[2,0,1]]

       Weight Gender     Height
0  241.893563   Male  73.847017
2  212.740856   Male  74.110105
0  241.893563   Male  73.847017
4  206.349801   Male  69.881796
3  220.042470   Male  71.730978

In [ ]:
df.to_csv("")

In [9]:
df1 = pd.DataFrame(data=[[5,7,9],
                         [8,9,10]])
df1

   0  1   2
0  5  7   9
1  8  9  10